#1 
# Створіть програму, яка запитує користувача два цілих числа a і b, після чого виводить на екран результати наступних математичних операцій (результат округлити до 2-х знаків після коми):
# суму;
# різницю між a і b;
# добуток;
# ділення a на b;
# залишок від ділення a на b;
# десятковий логарифм числа a;
# результат піднесення числа a в ступінь b; квадратний корінь з числа a;
# поміняти значення цих чисел місцями (значення числа b запам’ятати в
# змінній з ім’ям a та навпаки).
import math

print("==" * 80)
print("Task 1")

while True:
    

    try:
        a = int(input("Введіть перше число: "))
        b = int(input("Введіть друге число: "))
        
        print(f"Сума: {a + b}")
        print(f"Різниця: {a - b}")
        print(f"Добуток: {a * b}")
        print(f"Ділення: {(a / b):.2f}")
        print(f"Залишок від ділення: {a % b}")
        
        if a <= 0:
            print("Логарифм і корінь визначені тільки для додатних чисел.")
        else:
            print(f"Десятковий логарифм числа a: {(math.log10(a)):.2f}")
            print(f"Квадратний корінь з числа a: {(math.sqrt(a)):.2f}")
            
        print(f"Результат піднесення числа a в ступінь b: {(a ** b):.2f}")

        a, b = b, a

        print(f"Поміняні значення: a = {a}, b = {b}")
        
        break
    
    except (ValueError, ZeroDivisionError):
        print("Будь ласка, введіть коректні числа.")

# 2
# Дано тризначне число
# піднести це число до 3-го ступеня. Вважаючи, що результат – це розмір
# файлу кілобайтах, використовуючи операцію ділення націло,
# визначити, скільки це буде повних мегабайт, гігабайт
# у ньому закреслили першу зліва цифру і приписали її справа. Вивести
# отримане число;
# знайти суму і добуток його цифр;
# вивести число, отримане при перестановці цифр сотень і десятків
# вихідного числа (наприклад, 123 перейде в 213).

print("==" * 80)
print("Task 2")


while True:
    try:
        number = int(input("Введіть тризначне число: "))
        
        if not (100 <= number < 1000):
            print("Будь ласка, введіть тризначне число.")
            continue
        
        size_kb = number ** 3
        size_mb = size_kb // 1024
        size_gb = size_kb // (1024 * 1024)

        print("Size in KB:", size_kb)
        print("Full MB:", size_mb)
        print("Full GB:", size_gb)

        first = number // 100
        rest = number % 100

        new_number = rest * 10 + first

        print("New number:", new_number)

        print(f"Sum of digits: {sum(map(int, str(number)))}")
        
        tens = (number // 10) % 10
        ones = number % 10
        
        product_digits = first * tens * ones

        print(f"Product of digits: {product_digits}")

        swapped = tens * 100 + first * 10 + ones

        print(f"Swapped hundreds and tens: {swapped}")
        
        break
    
    except ValueError:
        print("Будь ласка, введіть коректне число.")
        
# 3
# Напишіть програму, яка запитуватиме у користувача значення
# температури в градусах Цельсія та відображатиме еквівалентний показник за
# шкалами Фаренгейта та Кельвіна. Необхідні коефіцієнти та формули для
# проведення розрахунків знайти в інтернеті.

print("==" * 80)
print("Task 3")

while True:
    try:
        celsius = float(input("Введіть температуру в градусах Цельсія: "))
        
        if celsius < -273.15:
            print("Температура не може бути нижче абсолютного нуля (-273.15°C).\n")
            continue
        
        fahrenheit = (celsius * 9/5) + 32
        kelvin = celsius + 273.15

        print(f"Температура в Фаренгейтах: {fahrenheit:.2f}")
        print(f"Температура в Кельвінах: {kelvin:.2f}")
        break
    
    except ValueError:
        print("Будь ласка, введіть коректне число.")
        
# 4
# Напишіть програму, яка запитує у користувача три цілих числа та
# виводить їх у впорядкованому вигляді – за зростанням. Використовуйте
# функції min та max для знаходження найменшого та найбільшого значень.
# Число, що залишилося, можна знайти шляхом віднімання із суми трьох
# введених чисел максимального і мінімального.

print("==" * 80)
print("Task 4")

while True:
    try:
        num1 = int(input("Введіть перше ціле число: "))
        num2 = int(input("Введіть друге ціле число: "))
        num3 = int(input("Введіть третє ціле число: "))
        
        min_num = min(num1, num2, num3)
        max_num = max(num1, num2, num3)
        
        middle_num = (num1 + num2 + num3) - min_num - max_num
        
        print(f"Впорядковані числа: {min_num}, {middle_num}, {max_num}")
        break
    except ValueError:
        print("Будь ласка, введіть коректне ціле число.")